workn = "每日作业20"

row, col = 25, 33  # 网格的列、行数
wd, ht = 50, 29  # 网格的宽、高对应图片上的像素点数

a_info=(20,2,25,4) #考生信息区答题区域网格范围
a_info_list={"group":((2,1),(1,2,4,8)),#考生信息区答题区域设置 信息项:第一个选项位置，选项内容
            "no":((2,2),(1,2,4,8))}

a_obj = (1, 4, 25, 9)  # 客观题答题区域网格
a_obj_list={"1":((3,1),"ABCD",3),#客观题选项设置区域(相对) 题号:第一个选项位置，选项内容，分值
            "2":((3,2),"ABCD",3),
            "3":((3,3),"ABCD",3),
            "4":((3,4),"ABCD",3),
            "5":((3,5),"ABCD",3),

            "6":((9,1),"ABCD",3),
            "7":((9,2),"ABCD",3),
            "8":((9,3),"ABCD",3),
            "9":((9,4),"ABCD",3),
            "10":((9,5),"ABCD",3),

            "11":((15,1),"ABCD",3),
            "12":((15,2),"ABCD",3),
            "13":((15,3),"ABCD",3),
            "14":((15,4),"ABCD",3),
            "15":((15,5),"ABCD",3),

            "16":((21,1),"ABCD",3),
            "17":((21,2),"ABCD",3),
            "18":((21,3),"ABCD",3),
            "19":((21,4),"ABCD",3),
            "20":((21,5),"ABCD",3)}

a_sub = {"21":((1, 10, 25, 23),20),#主观题 题号：网格范围，分值
         "22":((1, 24, 25, 33),20)}

ans_obj=["A","C","B","D","C","A","C","B","D","C","A","C","B","D","C","A","C","B","D","C"]##客观题答案